kz=0.25, cell=3, light=-38, view=-45
100 *  math.sin(r/ 20) # sin
x=100.0, y=0.0, vx=0.0, vy=1.0
kz=1.0, cell=6, light=-7, view=0
math.sin((x - y) / 50)  # нецентральная
x=-287.0, y=-244.0, vx=0.0, vy=0.5
kz=1.0, cell=11, light=-7, view=0
0.01 * r # сила не зависит от расстояния, есть круговые орбиты
x=100.0, y=0.0, vx=0.0, vy=1.0
kz=1.0, cell=11, light=-7, view=0
-100 / (r+0.0001)  # потенциал поля тяготения (сила обратно пропорц. квадрату расстояния)
x=100.0, y=0.0, vx=0.0, vy=1.0
kz=1.0, cell=11, light=-7, view=0
-5000 / (r**2 + 0.0001) # сила обратно пропорц. кубу расстояния - неуст.орбиты
x=100.0, y=0.0, vx=0.0, vy=1.0
